# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
# За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них.

# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

firstClass = int(input("Введите количество учеников в первом классе: "))
secondClass = int(input("Введите количество учеников во втором классе: "))
thirdClass = int(input("Введите количество учеников в третьем классе: "))

print(studentSum // 2 + (studentSum % 2 != 0))